Repository: dmy3k/gnome-adaptive-brightness
Catalog: po/*.po
Languages: es, sv, uk

source: Adaptive Brightness Extension
es: Extensión de Brillo Adaptativo
sv: Adaptiv Ljusstyrka
uk: Адаптивна яскравість

source: Ambient Light Sensor is not available. Extension will not function
es: El sensor de luz ambiente no está disponible. La extensión no funcionará
sv: Ljussensor ej tillgänglig. Tillägget fungerar inte
uk: Датчик освітлення недоступний. Розширення не працюватиме

source: GNOME's automatic brightness feature is enabled. Press to disable it in Settings → Power, allowing the extension to work properly.
es: La función de brillo automático de GNOME está habilitada. Presione para deshabilitarla en Configuración → Energía, permitiendo que la extensión funcione correctamente.
sv: GNOMEs automatisk ljusstyrka är aktiverad. Tryck för att inaktivera den i Inställningar → Energi så att tillägget kan fungera.
uk: Автояскравість GNOME увімкнено. Натисніть, щоб вимкнути у Параметри → Живлення, дозволивши розширенню працювати.

source: Adaptive Brightness
es: Brillo Adaptativo
sv: Adaptiv Ljusstyrka
uk: Адаптивна яскравість

source: Automatic brightness management is paused. Dismiss this notification to resume.
es: La gestión automática del brillo está en pausa. Cierre esta notificación para reanudar.
sv: Automatisk ljusstyrka är pausad. Stäng meddelandet för att fortsätta.
uk: Автояскравість призупинено. Закрийте це сповіщення для відновлення.

source: Settings
es: Configuración
sv: Inställningar
uk: Параметри

source: Brightness
es: Brillo
sv: Ljusstyrka
uk: Яскравість

source: Brightness Curve
es: Curva de Brillo
sv: Ljusstyrkekurva
uk: Крива яскравості

source: Current sensor value and brightness mapping
es: Valor actual del sensor y mapeo de brillo
sv: Aktuellt sensorvärde och ljusstyrkemappning
uk: Поточне значення датчика та відповідність яскравості

source: Configuration
es: Configuración
sv: Konfiguration
uk: Конфігурація

source: Import or export brightness settings
es: Importar o exportar configuración de brillo
sv: Importera eller exportera ljusstyrkeinställningar
uk: Імпорт або експорт налаштувань яскравості

source: Export configuration
es: Exportar configuración
sv: Exportera konfiguration
uk: Експорт конфігурації

source: Import configuration
es: Importar configuración
sv: Importera konfiguration
uk: Імпорт конфігурації

source: Reset to Defaults
es: Restaurar valores predeterminados
sv: Återställ
uk: Скинути

source: Restore the default brightness configuration
es: Restaurar la configuración de brillo predeterminada
sv: Återställ standardinställningar för ljusstyrka
uk: Відновити типові налаштування яскравості

source: Keyboard
es: Teclado
sv: Tangentbord
uk: Клавіатура

source: Automatic Keyboard Backlight
es: Retroiluminación Automática del Teclado
sv: Automatisk Tangentbordsbelysning
uk: Автопідсвітка клавіатури

source: Select keyboard backlight level for each brightness range. Set to "Off" to disable backlight for that range.
es: Seleccione el nivel de retroiluminación del teclado para cada rango de brillo. Configure en "Apagado" para desactivar la retroiluminación para ese rango.
sv: Välj belysningsnivå för varje ljusstyrkeområde. Sätt till "Av" för att inaktivera belysning i området.
uk: Оберіть рівень підсвітки для кожного діапазону яскравості. Встановіть "Вимк", щоб вимкнути підсвітку для цього діапазону.

source: Idle Timeout
es: Tiempo de Inactividad
sv: Inaktivitetstid
uk: Час очікування

source: Turn off keyboard backlight after inactivity (seconds)
es: Apagar la retroiluminación del teclado después de inactividad (segundos)
sv: Stäng av tangentbordsbelysning efter inaktivitet (sekunder)
uk: Вимкнути підсвітку клавіатури після неактивності (секунди)

source: Off
es: Apagado
sv: Av
uk: Вимк

source: On
es: Encendido
sv: På
uk: Увімк

source: Low
es: Bajo
sv: Låg
uk: Низький

source: High
es: Alto
sv: Hög
uk: Високий

source: Medium
es: Medio
sv: Medel
uk: Середній

source: Export Configuration
es: Exportar Configuración
sv: Exportera konfiguration
uk: Експорт конфігурації

source: Cancel
es: Cancelar
sv: Avbryt
uk: Скасувати

source: Export
es: Exportar
sv: Exportera
uk: Експорт

source: JSON files
es: Archivos JSON
sv: JSON-filer
uk: Файли JSON

source: Export Error
es: Error de Exportación
sv: Exportfel
uk: Помилка експорту

source: Failed to export: %s
es: Error al exportar: %s
sv: Kunde inte exportera: %s
uk: Не вдалося експортувати: %s

source: Import Configuration
es: Importar Configuración
sv: Importera konfiguration
uk: Імпорт конфігурації

source: Import
es: Importar
sv: Importera
uk: Імпорт

source: Import Failed
es: Importación Fallida
sv: Import misslyckades
uk: Помилка імпорту

source: Failed to read the selected file.
es: Error al leer el archivo seleccionado.
sv: Kunde inte läsa vald fil.
uk: Не вдалося прочитати обраний файл.

source: Import Error
es: Error de Importación
sv: Importfel
uk: Помилка імпорту

source: Failed to import configuration: %s
es: Error al importar la configuración: %s
sv: Kunde inte importera konfiguration: %s
uk: Не вдалося імпортувати конфігурацію: %s

source: Invalid Configuration
es: Configuración Inválida
sv: Ogiltig konfiguration
uk: Невірна конфігурація

source: Missing or invalid brightness-buckets array.
es: Array de rangos de brillo faltante o inválido.
sv: Saknad eller ogiltig ljusstyrkeområdesmatris.
uk: Відсутній або невірний масив діапазонів яскравості.

source: Invalid Bucket Count
es: Cantidad de Rangos Inválida
sv: Ogiltigt antal områden
uk: Невірна кількість діапазонів

source: Configuration has %d buckets. Must be between 5 and 20.
es: La configuración tiene %d rangos. Debe tener entre 5 y 20.
sv: Konfigurationen har %d områden. Måste vara mellan 5 och 20.
uk: Конфігурація має %d діапазонів. Має бути від 5 до 20.

source: Invalid Bucket Format
es: Formato de Rango Inválido
sv: Ogiltigt områdesformat
uk: Невірний формат діапазону

source: Bucket %d has invalid format. Expected [min, max, brightness] array.
es: El rango %d tiene formato inválido. Se espera array [min, max, brillo].
sv: Område %d har ogiltigt format. Förväntar [min, max, ljusstyrka].
uk: Діапазон %d має невірний формат. Очікується [min, max, яскравість].

source: Invalid Bucket Values
es: Valores de Rango Inválidos
sv: Ogiltiga värden
uk: Невірні значення

source: Bucket %d contains non-numeric values.
es: El rango %d contiene valores no numéricos.
sv: Område %d innehåller icke-numeriska värden.
uk: Діапазон %d містить нечислові значення.

source: Invalid Lux Range
es: Rango de Lux Inválido
sv: Ogiltigt lux-område
uk: Невірний діапазон люкс

source: Bucket %d: min=%d, max=%d. Must have 0 ≤ min < max ≤ 10000.
es: Rango %d: min=%d, max=%d. Debe tener 0 ≤ min < max ≤ 10000.
sv: Område %d: min=%d, max=%d. Måste ha 0 ≤ min < max ≤ 10000.
uk: Діапазон %d: min=%d, max=%d. Має бути 0 ≤ min < max ≤ 10000.

source: Invalid Brightness
es: Brillo Inválido
sv: Ogiltig ljusstyrka
uk: Невірна яскравість

source: Bucket %d: brightness=%f. Must be between 0 and 1.
es: Rango %d: brillo=%f. Debe estar entre 0 y 1.
sv: Område %d: ljusstyrka=%f. Måste vara mellan 0 och 1.
uk: Діапазон %d: яскравість=%f. Має бути від 0 до 1.

source: Invalid Bucket Order
es: Orden de Rangos Inválido
sv: Ogiltig områdesordning
uk: Невірний порядок діапазонів

source: Bucket %d: min values must be strictly increasing.
es: Rango %d: los valores mínimos deben aumentar estrictamente.
sv: Område %d: min-värden måste öka strikt.
uk: Діапазон %d: min має строго зростати.

source: Bucket %d: max values must be strictly increasing.
es: Rango %d: los valores máximos deben aumentar estrictamente.
sv: Område %d: max-värden måste öka strikt.
uk: Діапазон %d: max має строго зростати.

source: Bucket Gap Detected
es: Brecha en Rangos Detectada
sv: Lucka upptäckt
uk: Виявлено прогалину

source: Bucket %d: min (%d) creates a gap with previous bucket's max (%d). Buckets must overlap or be continuous.
es: Rango %d: min (%d) crea una brecha con el max (%d) del rango anterior. Los rangos deben superponerse o ser continuos.
sv: Område %d: min (%d) skapar lucka mot föregående max (%d). Områden måste överlappa eller vara sammanhängande.
uk: Діапазон %d: min (%d) створює прогалину з max (%d) попереднього. Діапазони мають перекриватися або бути безперервними.

source: Excessive Overlap
es: Superposición Excesiva
sv: För stor överlappning
uk: Надмірне перекриття

source: Bucket %d overlaps too much (>90%%) with previous bucket.
es: El rango %d se superpone demasiado (>90%%) con el rango anterior.
sv: Område %d överlappar för mycket (>90%%) med föregående område.
uk: Діапазон %d надто перекривається (>90%%) з попереднім.

source: Invalid Keyboard Settings
es: Configuración de Teclado Inválida
sv: Ogiltiga tangentbordsinställningar
uk: Невірні налаштування клавіатури

source: keyboard-backlight-levels must be an array.
es: keyboard-backlight-levels debe ser un array.
sv: keyboard-backlight-levels måste vara en matris.
uk: keyboard-backlight-levels має бути масивом.

source: Mismatched Settings
es: Configuraciones Incompatibles
sv: Inställningar matchar ej
uk: Неузгоджені налаштування

source: Keyboard backlight levels count must match bucket count.
es: La cantidad de niveles de retroiluminación debe coincidir con la cantidad de rangos.
sv: Antal belysningsnivåer måste matcha antal områden.
uk: Кількість рівнів підсвітки має відповідати кількості діапазонів.

source: Invalid Keyboard Level
es: Nivel de Teclado Inválido
sv: Ogiltig tangentbordsnivå
uk: Невірний рівень клавіатури

source: Level %d: %d. Must be integer between 0 and 10.
es: Nivel %d: %d. Debe ser un entero entre 0 y 10.
sv: Nivå %d: %d. Måste vara heltal mellan 0 och 10.
uk: Рівень %d: %d. Має бути ціле число від 0 до 10.

source: Invalid Timeout
es: Tiempo de Espera Inválido
sv: Ogiltig timeout
uk: Невірний час очікування

source: Keyboard idle timeout must be between 5 and 60 seconds.
es: El tiempo de inactividad del teclado debe estar entre 5 y 60 segundos.
sv: Inaktivitetstid måste vara mellan 5 och 60 sekunder.
uk: Час очікування має бути від 5 до 60 секунд.

source: OK
es: Aceptar
uk: Гаразд
